## Innomatics Research Labs Hackathon

In [142]:
#importing pandas
import pandas as pd
import numpy as np
import matplotlib as plt
import sqlite3

In [143]:
#orders data
df=pd.read_csv("orders.csv")
df1=pd.read_json('users.json')
df2=pd.read_excel('Res_data.xlsx')
print()

In [144]:
#Merging the data 
df_mer1=pd.merge(df,df1,on='user_id',how='left')
df_mer2=pd.merge(df_mer1,df2,on='restaurant_id',how='left')
df_mer2

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0
...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,2528,249,21-05-2023,1211.96,Royal Kitchen North Indian,User_2528,Hyderabad,Gold,Restaurant_249,Italian,4.7
9996,9997,2867,267,06-08-2023,1188.05,Darbar Cafe Punjabi,User_2867,Bangalore,Regular,Restaurant_267,Chinese,4.2
9997,9998,522,420,11-11-2023,979.44,Ruchi Tiffins Chinese,User_522,Bangalore,Gold,Restaurant_420,Italian,4.0
9998,9999,319,492,08-09-2023,1105.93,Swagath Kitchen North Indian,User_319,Bangalore,Gold,Restaurant_492,Italian,4.0
9999,10000,457,439,21-10-2023,879.58,Classic Cafe Family Restaurant,User_457,Chennai,Regular,Restaurant_439,Mexican,3.1

In [145]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     3000 non-null   int64
 1   name        3000 non-null   object
 2   city        3000 non-null   object
 3   membership  3000 non-null   object
dtypes: int64(1), object(3)
memory usage: 93.9+ KB

In [146]:
df_mer2.to_csv('final_food_delivery_dataset.csv')

In [147]:
df_mer2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   order_id           10000 non-null  int64
 1   user_id            10000 non-null  int64
 2   restaurant_id      10000 non-null  int64
 3   order_date         10000 non-null  object
 4   total_amount       10000 non-null  float64
 5   restaurant_name_x  10000 non-null  object
 6   name               10000 non-null  object
 7   city               10000 non-null  object
 8   membership         10000 non-null  object
 9   restaurant_name_y  10000 non-null  object
 10  cuisine            10000 non-null  object
 11  rating             10000 non-null  float64
dtypes: float64(2), int64(3), object(7)
memory usage: 937.6+ KB

## Which city has the highest total revenue (total_amount) from Gold members?

In [148]:
df_mer2[df_mer2['membership'] == 'Gold'].groupby('city')['total_amount'].sum()

city
Bangalore     994702.59
Chennai      1080909.79
Hyderabad     896740.19
Pune         1003012.32
Name: total_amount, dtype: float64

## Which cuisine has the highest average order value across all orders?

In [149]:
df_mer2.groupby('cuisine')['total_amount'].mean()

cuisine
Chinese    798.389020
Indian     798.466011
Italian    799.448578
Mexican    808.021344
Name: total_amount, dtype: float64

## How many distinct users placed orders worth more than ₹1000 in total (sum of all their orders)?

In [150]:
(df_mer2.groupby('user_id')['total_amount'].sum()>1000).sum()

np.int64(2544)

## Which restaurant rating range generated the highest total revenue?

In [151]:
df_pr=df_mer2.groupby('rating')['total_amount'].sum().sort_values()

In [152]:
count1=count2=count3=count4=0
for i,j in df_pr.items():
    if i>=3.0 and i<=3.5:
        count1+=j
    elif i>=3.6 and i<=4.0:
        count2+=j
    elif i>=4.1 and i<=4.5:
        count3+=j
    elif i>=4.6 and i<=5.0:
        count4+=j
print(count1,count2,count3,count4)

2136772.7 1717494.41 1960326.26 2197030.75

## Among Gold members, which city has the highest average order value?

In [153]:
df_mer2[df_mer2['membership'] == 'Gold'].groupby('city')['total_amount'].mean()

city
Bangalore    793.223756
Chennai      808.459080
Hyderabad    806.421034
Pune         781.162243
Name: total_amount, dtype: float64

In [154]:
df_mer2.groupby(['cuisine','restaurant_name_x'])['total_amount'].sum().sort_values()

cuisine  restaurant_name_x
Chinese  New Restaurant Chinese            6724.81
Mexican  Amma Cafe North Indian            7347.77
         Ruchi Tiffins Pure Veg            7620.96
Italian  Darbar Restaurant Punjabi         8259.62
         Sri Restaurant Andhra             8376.52
                                            ...
Indian   Swagath Delights Andhra          36830.08
Italian  Classic Delights North Indian    38034.84
Indian   Amma Eatery Non-Veg              38417.11
Chinese  Sai Biryani Non-Veg              40942.97
         Swagath Cafe Multicuisine        45821.74
Name: total_amount, Length: 485, dtype: float64

## Which cuisine has the lowest number of distinct restaurants but still contributes significant revenue?

In [155]:
df_pr=df_mer2.groupby('cuisine').agg(
    {
        'restaurant_name_x':'nunique',
        'total_amount':'sum'
    }
)

In [156]:
df_pr

         restaurant_name_x  total_amount
cuisine
Chinese                115    1930504.65
Indian                 122    1971412.58
Italian                124    2024203.80
Mexican                124    2085503.09

## What percentage of total orders were placed by Gold members? (Rounded to nearest integer)

In [157]:
len(df_mer2[df_mer2['membership'] == 'Gold'])

4987

In [158]:
round((4987/len(df_mer2))*100)

50

## Which restaurant has the highest average order value but less than 20 total orders?

In [159]:
df_pr = df_mer2.groupby(['restaurant_id','restaurant_name_x']).agg({
    'total_amount': 'mean',
    'order_id': 'count'
})
result = df_pr.query("restaurant_name_x == 'Grand Cafe Punjabi'")
print(result)

                                  total_amount  order_id
restaurant_id restaurant_name_x
112           Grand Cafe Punjabi      759.1445        20
116           Grand Cafe Punjabi      775.8500        12

In [160]:
result = df_pr.query(" restaurant_name_x == 'Grand Restaurant South Indian'")
result

                                             total_amount  order_id
restaurant_id restaurant_name_x
237           Grand Restaurant South Indian    842.567586        29

In [161]:
result = df_pr.query(" restaurant_name_x == 'Ruchi Mess Multicuisine'")
result

                                       total_amount  order_id
restaurant_id restaurant_name_x
385           Ruchi Mess Multicuisine    938.202778        18
389           Ruchi Mess Multicuisine    780.063636        22

In [162]:
result = df_pr.query(" restaurant_name_x == 'Ruchi Foods Chinese'")
result

                                   total_amount  order_id
restaurant_id restaurant_name_x
421           Ruchi Foods Chinese    686.603158        19

## Which combination contributes the highest revenue?

In [163]:
df_mer2.groupby(['membership','cuisine'])['total_amount'].sum().sort_values(ascending=False)

membership  cuisine
Regular     Mexican    1072943.30
            Italian    1018424.75
Gold        Mexican    1012559.79
            Italian    1005779.05
Regular     Indian      992100.27
Gold        Indian      979312.31
            Chinese     977713.74
Regular     Chinese     952790.91
Name: total_amount, dtype: float64

## During which quarter of the year is the total revenue highest?

In [164]:
df_mer2['order_date']=pd.to_datetime(df_mer2['order_date'],format='%d-%m-%Y')
df_mer2['quarter']=df_mer2['order_date'].dt.quarter
df_mer2.groupby('quarter')['total_amount'].sum().sort_values()

quarter
2    1945348.72
1    2010626.64
4    2018263.66
3    2037385.10
Name: total_amount, dtype: float64

## How many total orders were placed by users with Gold membership?

In [165]:
df_mer2.groupby('membership')['order_id'].count()

membership
Gold       4987
Regular    5013
Name: order_id, dtype: int64

## What is the total revenue (rounded to nearest integer) generated from orders placed in Hyderabad city?

In [166]:
df_mer2.groupby('city')['total_amount'].sum()
round(1889366.58)

1889367

## How many distinct users placed at least one order?

In [167]:
df_pr=df_mer2.groupby('user_id')['order_id'].count()

In [168]:
count=0
for i,j in df_pr.items():
    if j>=1:
        count+=1
count

2883

## What is the average order value (rounded to 2 decimals) for Gold members?

In [169]:
df_mer2.groupby('membership')['total_amount'].mean()

membership
Gold       797.145556
Regular    805.158434
Name: total_amount, dtype: float64

In [170]:
round(797.145556,ndigits=2)

797.15

## How many orders were placed for restaurants with rating ≥ 4.5?

In [171]:
df_pr=df_mer2.groupby('rating')['order_id'].count()

In [172]:
count=0
for i,j in df_pr.items():
    if i>=4.5:
       count+=j
count

3374

## How many orders were placed in the top revenue city among Gold members only?

In [173]:
df_mer2.groupby(['city','membership'])['order_id'].count()

city       membership
Bangalore  Gold          1254
           Regular       1497
Chennai    Gold          1337
           Regular       1132
Hyderabad  Gold          1112
           Regular       1238
Pune       Gold          1284
           Regular       1146
Name: order_id, dtype: int64